## Práctica Individual

Utilizando el archivo _sales.csv_ de la primera clase:

- Cargarlo en un dataframe e inspeccionar los tipos de datos.
- Suponiendo que encontramos que todos los valores de la columna 1 son incorrectos y debería sumarse 1 unidad a cada uno. Utilizar **df.apply** para agregar esa cantidad a los valores.
- Cambiar todos los valores de la columna price mayores a 50000 por NaN. Luego, rellenar estos valores con el anterior en la columna.
- Utilizar **value_counts** para contar los valores de la columna 1 del dataset.

## Bonus

- Agregar 3 unidades a la columna Price
- Utilizar **value_counts** para cada una de las columnas del dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('sales.csv')

In [3]:
df.head(10)

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,Russel and Anderson,Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won

In [4]:
df.shape

(17, 8)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
Account     17 non-null int64
Name        17 non-null object
Rep         17 non-null object
Manager     17 non-null object
Product     17 non-null object
Quantity    17 non-null int64
Price       17 non-null int64
Status      17 non-null object
dtypes: int64(3), object(5)
memory usage: 1.1+ KB

In [6]:
df.iloc[:,0] = df.iloc[:,0].apply(lambda x: x+1)

In [7]:
np.sum(df.isnull())

Account     0
Name        0
Rep         0
Manager     0
Product     0
Quantity    0
Price       0
Status      0
dtype: int64

In [8]:
df["Price"] = df["Price"].apply(lambda x: np.nan if x>50000 else x)

In [9]:
np.sum(df.isnull())

Account     0
Name        0
Rep         0
Manager     0
Product     0
Quantity    0
Price       4
Status      0
dtype: int64

In [10]:
df[df['Price'].isnull()]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
4,146833,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,NaN,won
9,141963,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,NaN,won
14,688982,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,NaN,won
15,729834,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,NaN,declined

In [11]:
df['Price'].fillna(method='ffill', inplace=True)

In [12]:
np.sum(df.isnull())

Account     0
Name        0
Rep         0
Manager     0
Product     0
Quantity    0
Price       0
Status      0
dtype: int64

In [13]:
df['Account'].value_counts()

714467    3
218896    2
729834    2
239345    2
163417    1
740151    1
307600    1
146833    1
737551    1
412291    1
141963    1
688982    1
Name: Account, dtype: int64

In [14]:
df["Price"] = df["Price"].apply(lambda x: x+3)

In [15]:
for c in df.columns:
    print ('-----{}-----'.format(c))
    print (df[c].value_counts())
    print('')

-----Account-----
714467    3
218896    2
729834    2
239345    2
163417    1
740151    1
307600    1
146833    1
737551    1
412291    1
141963    1
688982    1
Name: Account, dtype: int64

-----Name-----
Trantow-Barrows        3
Kulas Inc              2
Stokes LLC             2
Koepp Ltd              2
Jerde-Hilpert          1
Purdy-Kunde            1
Ondricka and Metz      1
Herman LLC             1
Russel and Anderson    1
Barton LLC             1
Kiehn-Spinka           1
Keeling LLC            1
Name: Name, dtype: int64

-----Rep-----
Cedric Moss      4
Craig Booker     4
Wendy Yule       4
Daniel Hilton    3
John Smith       2
Name: Rep, dtype: int64

-----Manager-----
Debra Henley     9
Fred Anderson    8
Name: Manager, dtype: int64

-----Product-----
CPU            9
Maintenance    4
Software       3
Monitor        1
Name: Product, dtype: int64

-----Quantity-----
1    8
2    7
5    1
3    1
Name: Quantity, dtype: int64

-----Price-----
5003.0     4
35003.0    4
10003.0    3
7003.0     3
30003.0    2
40003.0    1
Name: Price, dtype: int64

-----Status-----
presented    6
pending      4
won          4
declined     3
Name: Status, dtype: int64